smash> smash error: kill: job-id 1 does not exist
smash> smash> smash> smash error: kill: invalid arguments
smash> [1] sleep 10& : 20608 0 secs
smash> smash> [1] sleep 10& : 20608 1 secs
[2] sleep 5& : 20609 0 secs
smash> smash> [1] sleep 10& : 20608 2 secs
[2] sleep 5& : 20609 1 secs
[3] sleep 3& : 20610 1 secs
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash> smash> [1] sleep 10 & : 20613 3 secs
smash> signal number 9 was sent to pid 20613
smash> smash> smash> smash> smash: got ctrl-Z
smash: process 20616 was stopped
smash> [1] sleep 5& : 20614 1 secs
[2]           sleep        10   & : 20615 1 secs
[3] sleep 15 : 20616 1 secs (stopped)
smash> signal number 9 was sent to pid 20614
smash> [2]           sleep        10   & : 20615 1 secs
[3] sleep 15 : 20616 1 secs (stopped)
smash> signal number 9 was sent to pid 20615
smash> [3] sleep 15 : 20616 1 secs (stopped)
smash> signal number 9 was sent to pid 20616
smash> smash> smash> signal number 19 was sent to pid 20617
smash> [1] sleep 10& : 20617 3 secs (stopped)
smash> smash: got ctrl-C
smash: process 20618 was killed
smash> signal number 9 was sent to pid 20617
smash> smash: sending SIGKILL signal to 0 jobs:
