smash> smash error: timeout: invalid arguments
smash> smash error: timeout: invalid arguments
smash> smash error: timeout: invalid arguments
smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
smash> before
smash> smash: got an alarm
after
smash> 0
Done: 2
smash> smash: got an alarm
after
smash> smash: got an alarm
smash: timeout 3 ./my_sleep 4 timed out!
smash> smash: got ctrl-C
smash> smash> /bin/bash: ./mysleep: No such file or directory
smash> smash: got an alarm
smash: got ctrl-C
smash> smash: got ctrl-C
smash: process 20563 was killed
smash> before
smash> smash: got an alarm
after
smash> smash> smash> smash: got an alarm
smash: timeout 5 ./my_sleep 10 & timed out!
smash: got an alarm
smash: timeout 9 ./my_sleep 20 timed out!
smash> smash> smash> smash: got an alarm
smash: timeout 3 ./my_sleep 20& timed out!
smash: got an alarm
smash: timeout 7 ./my_sleep 10& timed out!
smash: got ctrl-C
smash> smash error: bg: there is no stopped jobs to resume
smash> smash: got ctrl-Z
smash error: bg: there is no stopped jobs to resume
smash> smash: got an alarm
smash: timeout 3 ./my_sleep 20& timed out!
smash> smash> timeout 3 ./my_sleep 20& : 20579
smash: got ctrl-Z
smash: process 20579 was stopped
smash> timeout 3 ./my_sleep 20& : 20579
smash> smash: got an alarm
smash: timeout 3 ./my_sleep 20& timed out!
smash> smash> timeout 3 ./my_sleep 20& : 20581
smash: got ctrl-C
smash: process 20581 was killed
smash> smash> smash: got an alarm
smash> smash> smash> smash> [1] timeout 5 sleep 100& : 20583 1 secs
[2] timeout 10 sleep 200& : 20585 0 secs
[3] timeout 2 sleep 300& : 20587 0 secs
[4] timeout 7 sleep 400& : 20589 0 secs
smash> smash: got an alarm
smash: timeout 2 sleep 300& timed out!
smash: got an alarm
smash: timeout 5 sleep 100& timed out!
smash: got an alarm
smash: timeout 7 sleep 400& timed out!
smash: got an alarm
smash: timeout 10 sleep 200& timed out!
smash> smash> smash: got an alarm
smash: timeout 2 sleep 4& timed out!
smash: got ctrl-C
smash: process 20595 was killed
smash> smash> smash: got an alarm
smash: got ctrl-C
smash: process 20598 was killed
smash> smash: sending SIGKILL signal to 0 jobs:
